[
    {
        "id": 1,
        "name": "Cosell Bell",
        "rating": "4.20",
        "img": "https://www.incimages.com/uploaded_files/image/1920x1080/getty_481292845_77896.jpg",
        "comment": "Excellent service have nothing but good things to say about site order came as expected"
    },
    {
        "id": 2,
        "name": "Antorenzo Jackson",
        "rating": "4.5",
        "img": "https://secure.gravatar.com/avatar/e1d4ca5ffbd36dceeefe4dcbc7092195?s=140&d=mm&r=g",
        "comment": "Best watch i ever owned in my entire life came from this business her. All gold michael kors fashion watch. Nice price. It's just the shipping that had took forever. Even tho i paid for 2 day shipping. Took a week. So don't pay the extra money."
    },
    {
        "id": 3,
        "name": "Ken Bass",
        "rating": "4.60",
        "img": "https://st3.depositphotos.com/1037987/15097/i/600/depositphotos_150975580-stock-photo-portrait-of-businesswoman-in-office.jpg",
        "comment": "I will consider them highly for my next purchase. The watch arrived VERY well packaged (to include it being better secured for shipping inside the display box), no fingerprints, scratches or the like. "
    },
    {
        "id": 4,
        "name": "Richard Ye",
        "rating": "4.99",
        "img": "https://cdn.pixabay.com/photo/2014/07/09/10/04/man-388104_640.jpg",
        "comment": "I ordered a new Omega watch from Watchshopping, and was disappointed to have it arrive without the accompanying papers. This is a key part of the authentication and the value of the watch.I called their customer support line and was immediately answered by one of their agents."
    },
    {
        "id": 5,
        "name": "Leigh Peckham",
        "rating": "4.30",
        "img": "https://imageio.forbes.com/specials-images/imageserve/61688aa1d4a8658c3f4d8640/Antonio-Juliano/0x0.jpg?fit=bounds&format=jpg&width=960",
        "comment": "I've used this company twice so far and they have been great. They do exactly what they advertise doing and that sadly seems like a rarity nowadays. Top notch company. Will recommend."
    },
    {
        "id": 6,
        "name": "Tom Martelli",
        "rating": "4.99",
        "img": "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/image_data/file/120376/s960_Universities_Minister_Michelle_Donelan.jpeg",
        "comment": "This was my first time buying a watch from whitestore.com and I could not be happier! The watch I ordered came in perfect condition and the shipping was fast six days. The customer service was amazing! Pia was my rep she did everything possible to make this an awesome transaction! Thank you!"
    }
]